src/DataProcessors/ГрупповаяОбработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ГрупповаяОбработка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВФоне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючФоновогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндикаторПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВременногоХранилищаДляВнутреннегоОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТихийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПерезаписыватьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьБазуПослеОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключатьСеансы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешатьМножественныйПодборОдногоЭлемента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыТестирования</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОпределениеУстанавливаемогоРелизаОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПараллельныхПроцессов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбработки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонфигураций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обработчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РелизОбновления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановитьРелизОбновления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКонфигураций</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгружатьАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоматическиПерезаписыватьАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрыватьБазуПослеОбновления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтключатьСеансы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоОпределениеУстанавливаемогоРелизаОбновления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилаОбъединения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПравилаОбъединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВидыГрупповойОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыГрупповойОбработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеИБИзХранилищаКонфигураций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаАрхива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаАрхива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаСеансовУстановить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаСеансовСнять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаРегламентныхЗаданийУстановить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаРегламентныхЗаданийСнять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключитьСеансы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеОбработчика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ГрупповаяОбработка/Ext/ObjectModule.bsl
Перем мИмяСобытияВЖурналеРегистрации Экспорт;

//
//
Процедура ВыполнитьОбработку() Экспорт		
	
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.Список Цикл		
		
		ТекущийВидОбработки = СтрокаТаблицы.ВидОбработки;
		
		Если НЕ СтрокаТаблицы.Обрабатывать ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.ИнформационнаяБаза) Тогда Продолжить; КонецЕсли;		
		
		ПараметрыОбработки = ЗадачиНаСервере.ПолучитьСтруктуруПараметровОбработки(СтрокаТаблицы.ИнформационнаяБаза);			
		ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(ПараметрыОбработки, СтрокаТаблицы);		
				
		Если ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.ОбновлениеИБ") Тогда
			
			ВыполнитьАвтоПодборУстанавливаемогоРелизаОбновленияДляСтроки(СтрокаТаблицы);
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.УстановитьРелизОбновления) Тогда
				ПараметрыОбработки.ОписаниеОшибки = "Информационная база <" + СтрокаТаблицы.ИнформационнаяБаза + "> не обновлена: не выбран релиз обновления";
				ЖурналЛоговСервер.ВывестиСообщениеВЛог(ПараметрыОбработки);
				Продолжить;
			Иначе				
				Если ЗадачиНаСервере.ВыполнитьУстановкуОбновлений(ПараметрыОбработки, СтрокаТаблицы.УстановитьРелизОбновления) Тогда
					СтрокаТаблицы.РелизОбновления =СтрокаТаблицы.ИнформационнаяБаза.РелизОбновления;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.ОбновлениеИБИзХранилищаКонфигураций") Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ХранилищеКонфигураций) Тогда
				ПараметрыОбработки.ОписаниеОшибки = "Информационная база <" + СтрокаТаблицы.ИнформационнаяБаза + "> не обновлена: не выбрано хранилище конфигураций";
				ЖурналЛоговСервер.ВывестиСообщениеВЛог(ПараметрыОбработки);					
				Продолжить;
			Иначе				
				ЗадачиНаСервере.ВыполнитьУстановкуОбновлений(ПараметрыОбработки, СтрокаТаблицы.ХранилищеКонфигураций);				
				СтрокаТаблицы.РелизОбновления =СтрокаТаблицы.ИнформационнаяБаза.РелизОбновления;
			КонецЕсли;
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.Тестирование") Тогда			
			
			ЗадачиНаСервере.ВыполнитьТестированиеИсправление(ПараметрыОбработки);			
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.ВыгрузкаАрхива") Тогда			
			
			ЗадачиНаСервере.ВыполнитьВыгрузкуАрхива(ПараметрыОбработки);
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.ОбновлениеИнформации") Тогда			
			
			ЗадачиНаСервере.ВыполнитьОбновлениеИнформацииПоБазе(ПараметрыОбработки, Истина);	
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.БлокировкаСеансовУстановить") Тогда			
			
			ЗадачиНаСервере.ВыполнитьУстановкуБлокировкиСеансовИБ(ПараметрыОбработки, Истина);
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.БлокировкаСеансовСнять") Тогда			
			
			ЗадачиНаСервере.ВыполнитьУстановкуБлокировкиСеансовИБ(ПараметрыОбработки, Ложь);
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.БлокировкаРегламентныхЗаданийУстановить") Тогда						
			
			ЗадачиНаСервере.ВыполнитьУстановкуБлокировкиРегламентныхЗаданий(ПараметрыОбработки, Истина);
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.БлокировкаРегламентныхЗаданийСнять") Тогда						
			
			ЗадачиНаСервере.ВыполнитьУстановкуБлокировкиРегламентныхЗаданий(ПараметрыОбработки, Ложь);
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.ОтключитьСеансы") Тогда			
			
			ПараметрыОбработки.ОтключатьСеансы = Истина;
			ЗадачиНаСервере.ВыполнитьОтключениеСеансов(ПараметрыОбработки, Истина);
			
		ИначеЕсли ТекущийВидОбработки = ПредопределенноеЗначение("Перечисление.ВидыГрупповойОбработки.ВыполнениеОбработчика") Тогда			
			
			ЗадачиНаСервере.ВыполнитьЗапускОбработчика(ПараметрыОбработки,,Истина);
			
		КонецЕсли;		
		
		СтрокаТаблицы.Обрабатывать = Ложь;		
		
	КонецЦикла;
	
КонецПроцедуры

//
//
Процедура ВыполнитьАвтоПодборУстанавливаемогоРелизаОбновления() Экспорт
	
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.Список Цикл		
		
		ВыполнитьАвтоПодборУстанавливаемогоРелизаОбновленияДляСтроки(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

//
//
Процедура ВыполнитьАвтоПодборУстанавливаемогоРелизаОбновленияДляСтроки(СтрокаТаблицы) Экспорт	
	
	Если СтрокаТаблицы.ВидОбработки = Перечисления.ВидыГрупповойОбработки.ОбновлениеИБ И СтрокаТаблицы.АвтоОпределениеУстанавливаемогоРелизаОбновления Тогда
		
		СтрокаТаблицы.РелизОбновления = СтрокаТаблицы.ИнформационнаяБаза.РелизОбновления;
		
		ПараметрыОбработки = ЗадачиНаСервере.ПолучитьСтруктуруПараметровОбработки(СтрокаТаблицы.ИнформационнаяБаза);	
		ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(ПараметрыОбработки, СтрокаТаблицы);			
		
		МассивОбновлений = ЗадачиНаСервере.НайтиДопустимыеРелизыОбновления(ПараметрыОбработки);
		МассивОбновленийКоличество	= МассивОбновлений.Количество();
		Если МассивОбновленийКоличество > 0 Тогда
			
			СтрокаТаблицы.УстановитьРелизОбновления = МассивОбновлений[МассивОбновленийКоличество - 1];
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

мИмяСобытияВЖурналеРегистрации = "MultipleProcessing";
КоличествоПараллельныхПроцессов = 1;
